## src/terraform plan
```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # azurerm_resource_group.this will be created
+   resource "azurerm_resource_group" "this" {
+       id       = (known after apply)
+       location = "westus"
+       name     = "RG-TerraformDemo"
+       tags     = {
+           "Project" = "TerraformDemo"
+           "Purpose" = "Demo"
+           "TFLevel" = "TF100"
        }
    }

  # azurerm_subnet.this["subnet1"] will be created
+   resource "azurerm_subnet" "this" {
+       address_prefixes                               = [
+           "192.168.1.0/24",
        ]
+       enforce_private_link_endpoint_network_policies = (known after apply)
+       enforce_private_link_service_network_policies  = (known after apply)
+       id                                             = (known after apply)
+       name                                           = "OPS-Subnet"
+       private_endpoint_network_policies_enabled      = (known after apply)
+       private_link_service_network_policies_enabled  = (known after apply)
+       resource_group_name                            = "RG-TerraformDemo"
+       virtual_network_name                           = "VNET-TerraformDemo"
    }

  # azurerm_subnet.this["subnet2"] will be created
+   resource "azurerm_subnet" "this" {
+       address_prefixes                               = [
+           "192.168.2.0/24",
        ]
+       enforce_private_link_endpoint_network_policies = (known after apply)
+       enforce_private_link_service_network_policies  = (known after apply)
+       id                                             = (known after apply)
+       name                                           = "WEB-Subnet"
+       private_endpoint_network_policies_enabled      = (known after apply)
+       private_link_service_network_policies_enabled  = (known after apply)
+       resource_group_name                            = "RG-TerraformDemo"
+       virtual_network_name                           = "VNET-TerraformDemo"
    }

  # azurerm_subnet.this["subnet3"] will be created
+   resource "azurerm_subnet" "this" {
+       address_prefixes                               = [
+           "192.168.3.0/24",
        ]
+       enforce_private_link_endpoint_network_policies = (known after apply)
+       enforce_private_link_service_network_policies  = (known after apply)
+       id                                             = (known after apply)
+       name                                           = "DB-Subnet"
+       private_endpoint_network_policies_enabled      = (known after apply)
+       private_link_service_network_policies_enabled  = (known after apply)
+       resource_group_name                            = "RG-TerraformDemo"
+       virtual_network_name                           = "VNET-TerraformDemo"
    }

  # azurerm_subnet.this["subnet4"] will be created
+   resource "azurerm_subnet" "this" {
+       address_prefixes                               = [
+           "192.168.3.0/24",
        ]
+       enforce_private_link_endpoint_network_policies = (known after apply)
+       enforce_private_link_service_network_policies  = (known after apply)
+       id                                             = (known after apply)
+       name                                           = "Test-Subnet"
+       private_endpoint_network_policies_enabled      = (known after apply)
+       private_link_service_network_policies_enabled  = (known after apply)
+       resource_group_name                            = "RG-TerraformDemo"
+       virtual_network_name                           = "VNET-TerraformDemo"
    }

  # azurerm_virtual_network.this will be created
+   resource "azurerm_virtual_network" "this" {
+       address_space       = [
+           "192.168.0.0/24",
        ]
+       dns_servers         = (known after apply)
+       guid                = (known after apply)
+       id                  = (known after apply)
+       location            = "westus"
+       name                = "VNET-TerraformDemo"
+       resource_group_name = "RG-TerraformDemo"
+       subnet              = (known after apply)
+       tags                = {
+           "Project" = "TerraformDemo"
+           "Purpose" = "Demo"
+           "TFLevel" = "TF100"
        }
    }

Plan: 6 to add, 0 to change, 0 to destroy.
```